## :white_check_mark: Apply Result





<pre><code>Apply complete! Resources: 5 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
data.google_client_config.gcp: Reading...
module.github_webhook_gateway.data.google_project.project: Reading...
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.prow_k8s_cluster: Reading...
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer: Refreshing state... [id=sap-kyma-prow/roles/containeranalysis.occurrences.viewer]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_project_iam_binding.dns_collector_dns_reader: Refreshing state... [id=sap-kyma-prow/roles/dns.reader]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_executor_workloads_project_owner: Refreshing state... [id=sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_binding.dns_collector_bucket_get: Refreshing state... [id=sap-kyma-prow/projects/sap-kyma-prow/roles/BucketGet]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=855a9e69c8456439c97de0f50933e09215da23ba88f3d11f61e9195746970b7a]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
google_container_node_pool.components_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
google_container_node_pool.prowjobs_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/prowjobs-pool]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: secrettrustedusage\n  annotations:\n    metadata.gatekeeper.sh/title: \"Secret Trusted Usage\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls any Pod ability to use restricted secret.\nspec:\n  crd:\n    spec:\n      names:\n        kind: SecretTrustedUsage\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls any Pod ability to use use restricted secret.\n          properties:\n            labels:\n              type: array\n              description: >-\n                A list of labels and values the object must specify.\n              items:\n                type: object\n                properties:\n                  key:\n                    type: string\n                    description: >-\n                      The required label.\n                  allowedRegex:\n                    type: string\n                    description: >-\n                      Regular expression the label's value must match. The value must contain one exact match for\n                      the regular expression.\n            restrictedSecrets:\n              type: array\n              description: >-\n                A list of restricted secrets, which access is controlled by constraint.\n              items:\n                type: string\n                description: >-\n                  The restricted secret name.\n            trustedServiceAccounts:\n              type: array\n              description: >-\n                A list of trusted service accounts. If a Pod match criteria from trustedServiceAccount, it is allowed to use restricted secret.\n              items:\n                type: string\n                description: >-\n                  The trusted service account name.\n            trustedImages:\n              type: array\n              description: >-\n                A list of trusted images. If a Pod match criteria from trustedImage, it is allowed to use restricted secret.\n              items:\n                type: object\n                description: >-\n                  The trusted image criteria.\n                properties:\n                  image:\n                    type: string\n                    description: >-\n                      The container trusted image name. This can be a full image name or a prefix of image name with a wildcard.\n                      This is a required field.\n                  command:\n                    type: array\n                    description: >-\n                      The trusted command a container must match.\n                      If trusted command is not defined accept any value of command.\n                      If trusted command is empty list, a container must not define command.\n                      If trusted command is not empty list, a container must define exactly the same command.\n                      Number and order of commands must match.\n                      This is an optional field.\n                    items:\n                      type: string\n                  args:\n                    type: array\n                    description: >-\n                      The trusted arguments a container must match.\n                      If trusted args are not defined accept any value of args.\n                      If trusted args is empty list, a container must not define args.\n                      If trusted args is not empty list, a container must define exactly the same args.\n                      Number and order of args must match.\n                      This is an optional field.\n                    items:\n                      type: string\n                  entrypoint_options:\n                    type: string\n                    description: >-\n                      Regex to match the ENTRYPOINT_OPTIONS environemnt variable value.\n                      Validation of the ENTRYPOINT_OPTIONS environment variable is needed to control image execution in prowjob.\n                      Prow entrypoint command uses ENTRYPOINT_OPTIONS environment variable to pass wrapped command and arguments.\n                      If trusted entrypoint_options are not defined, container must not define ENTRYPOINT_OPTIONS env variable.\n                      To accept any value of ENTRYPOINT_OPTIONS container env variable, use .* regex as trusted entrypoint_options value.\n                      This is an optional field.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package kubernetes.secrettrustedusage\n        \n        import future.keywords.contains\n        import future.keywords.if\n        import future.keywords.in\n  \n        # Report violation if the container is using a restricted secret and does not match trusted usage criteria.\n        # Violation is check if secret is used in env.envFrom container spec.\n        violation[{\"msg\": msg}] {\n          some k\n          # Iterate over all containers in the pod.\n          container := input_containers[_]\n          # Check if the container is using a restricted secret.\n          container.envFrom[_].secretRef.name == input.parameters.restrictedSecrets[k]\n          # Check if container is not matching trusted usage criteria.\n          not trustedUsages(container)\n          # Format violation message.\n          msg := sprintf(\"Container %v is not allowed to use restricted secret: %v.\", [container.name, input.parameters.restrictedSecrets[k]])\n        }\n  \n        # Report violation if the container is using a restricted secret and does not match trusted usage criteria.\n        # Violation is check if secret is used in env.valueFrom container spec.\n        violation[{\"msg\": msg}] {\n          some k\n          # Iterate over all containers in the pod.\n          container := input_containers[_]\n          # Check if the container is using a restricted secret.\n          container.env[_].valueFrom.secretKeyRef.name == input.parameters.restrictedSecrets[k]\n          # Check if container is not matching trusted usage criteria.\n          not trustedUsages(container)\n          # Format violation message.\n          msg := sprintf(\"Container %v is not allowed to use restricted secret: %v.\", [container.name, input.parameters.restrictedSecrets[k]])\n        }\n  \n        # Report violation if the container is using a restricted secret and does not match trusted usage criteria.\n        # Violation is check if secret is mount as volume.\n        violation[{\"msg\": msg}] {\n          some k, j\n          # Iterate over all containers in the pod.\n          container := input_containers[_]\n          # Check if the container is using a restricted secret.\n          input.review.object.spec.volumes[j].secret.secretName == input.parameters.restrictedSecrets[k]\n          container.volumeMounts[_].name == input.review.object.spec.volumes[j].name\n          # Check if container is not matching trusted usage criteria.\n          not trustedUsages(container)\n          # Format violation message.\n          msg := sprintf(\"Container %v is not allowed to use restricted secret: %v.\", [container.name, input.parameters.restrictedSecrets[k]])\n        }\n        \n        trustedUsages(container) {\n          some j\n          # Get trusted service accounts, if not defined, use pod service account to match comparison.\n          trustedSA := object.get(input.parameters, \"trustedServiceAccounts\", [input.review.object.spec.serviceAccountName])\n          # Check if the container is using a trusted service account.\n          input.review.object.spec.serviceAccountName == trustedSA[_]\n          # Check if the container is using a trusted image.\n          glob.match(input.parameters.trustedImages[j].image, null, container.image)\n          # Check if the container is using a trusted commands.\n          checkCommand(container, input.parameters.trustedImages[j])\n          # Check if the container is using a trusted arguments.\n          checkArgs(container, input.parameters.trustedImages[j])\n          # Check if the container has required labels.\n          checkLabels(input.review.object, input.parameters)\n          # Check if the container is using a trusted entrypoint options.\n          checkEntrypointOptions(container, input.parameters.trustedImages[j])\n        }\n  \n        # Check if trusted usage criteria does not define required labels.\n        # Function evaluate too true if required labels are not defined.\n        checkLabels(reviewObject, inputParameters) if {\n          paramLabels := object.get(inputParameters, \"labels\", [])\n          # Check if the required labels array is empty.\n          count(paramLabels) == 0\n          # Getting pod labels to prevent unused variable error.\n          _ := object.get(reviewObject.metadata, \"labels\", [])\n        }\n  \n        # Check if the pod has required labels.\n        checkLabels(reviewObject, inputParameters) if {\n          # Check if the required labels array is not empty.\n          paramLabels := object.get(inputParameters, \"labels\", [])\n          count(paramLabels) > 0\n          # Check if the pod labels array is not empty.\n          reviewLabels := object.get(reviewObject.metadata, \"labels\", [])\n          count(reviewLabels) > 0\n          # Check if the pod has required labels.\n          value := reviewLabels[key]\n          expected := input.parameters.labels[_]\n          expected.key == key\n          # Check if the label value matches the regular expression.\n          # If the required label does not define allowedRegex, use default value \".*\" to match any value.\n          reg := object.get(expected, \"allowedRegex\", \".*\")\n          regex.match(reg, value)\n        }\n\n\n        # Check if the container is compliant with the trusted commands.\n        # Check evaluate too true if the container is using exactly the same command.\n        # Number and order of commands must match.\n\n        # If trusted command are not defined.\n        # If not defined, accept everything and evaluate too true.\n        checkCommand(container, trustedImage) if {\n          trustedCommand := object.get(trustedImage, \"command\", false)\n          trustedCommand == false\n          # Getting container command to prevent unused variable error.\n          _ := object.get(container, \"command\", [])\n        }\n\n        # If trusted command is empty list.\n        # If empty list, accept only container without command defined.\n        checkCommand(container, trustedImage) if {\n          trustedCommand := object.get(trustedImage, \"command\", false)\n          trustedCommand != false\n          count(trustedCommand) == 0\n          containerCommand := object.get(container, \"command\", [])\n          count(containerCommand) == 0\n        }\n\n        # If trusted command is not empty list.\n        # If not empty list, accept only container with exactly the same command.\n        checkCommand(container, trustedImage) if {\n          trustedCommand := object.get(trustedImage, \"command\", false)\n          trustedCommand != false\n          containerCommand := object.get(container, \"command\", false)\n          containerCommand != false\n          count(containerCommand) == count(trustedCommand)\n\n          # Allow using wildcard to match variable part of the command.\n          glob.match(trustedCommand[i], null, containerCommand[i])\n        }\n\n        # Check if the container is compliant with the trusted args.\n        # Check evaluate too true if the container is using exactly the same args.\n        # Number and order of args must match.\n\n        # If trusted args are not defined.\n        # If not defined, accept everything and evaluate too true.\n        checkArgs(container, trustedImage) if {\n          trustedArgs := object.get(trustedImage, \"args\", false)\n          trustedArgs != false\n          # Getting container args to prevent unused variable error.\n          _ := object.get(container, \"args\", [])\n        }\n\n        # If trusted args is empty list.\n        # If empty list, accept only container without args defined.\n        checkArgs(container, trustedImage) if {\n          trustedArgs := object.get(trustedImage, \"args\", false)\n          trustedArgs != false\n          count(trustedArgs) == 0\n          containerArgs := object.get(container, \"args\", [])\n          count(containerArgs) == 0\n          # Allow using wildcard to match variable part of the argument.\n          glob.match(trustedArgs[i], null, containerArgs[i])\n        }\n\n        # If trusted args is not empty list.\n        # If not empty list, accept only container with exactly the same args.\n        checkArgs(container, trustedImage) if {\n          trustedArgs := object.get(trustedImage, \"args\", [])\n          containerArgs := object.get(container, \"args\", [])\n          count(containerArgs) == count(trustedArgs)\n          # Allow using wildcard to match variable part of the argument.\n          glob.match(trustedArgs[i], null, containerArgs[i])\n        }\n\n        # CheckEntrypointOptions check if only one instance of ENTRYPOPINT_OPTIONS is defined in a container envs list\n  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

  - \"europe-docker.pkg.dev/gcr-cleaner/gcr-cleaner/gcr-cleaner-cli\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-prowjobs-namespace]
module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.data.google_project.project: Reading...
module.secrets_leaks_log_scanner.google_storage_bucket.kyma_prow_logs_secured: Refreshing state... [id=kyma-prow-logs-secured]
module.secrets_leaks_log_scanner.google_service_account.github_issue_finder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.secrets_leaks_log_scanner.google_service_account.github_issue_creator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs: Reading...
module.secrets_leaks_log_scanner.google_monitoring_alert_policy.secrets_leak_log_scanner: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/4186084580898851963]
module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs: Read complete after 0s [id=kyma-prow-logs]
module.secrets_leaks_log_scanner.google_monitoring_alert_policy.github_issue_creator: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/4186084580898851199]
module.secrets_leaks_log_scanner.google_monitoring_alert_policy.gcs_bucket_mover: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/14829426496191956253]
module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.secrets_leaks_log_scanner.google_monitoring_alert_policy.github_issue_finder: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/7170185124964513561]
module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.secrets_leak_detector: Refreshing state... [id=b/kyma-prow-logs/roles/storage.objectViewer/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker: Reading...
module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker: Read complete after 0s [id=735823064]
module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin: Refreshing state... [id=b/kyma-prow-logs-secured/roles/storage.objectAdmin/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_object_admin: Refreshing state... [id=b/kyma-prow-logs/roles/storage.objectAdmin/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_viewer: Refreshing state... [id=b/kyma-prow-logs/roles/storage.objectViewer/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]
module.secrets_leaks_log_scanner.google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner]
module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover]
module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder]
module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder]
module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_creator: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-creator]
module.secrets_leaks_log_scanner.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Refreshing state... [id=projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Refreshing state... [id=projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator]
module.secrets_leaks_log_scanner.google_workflows_workflow.secrets_leak_detector: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/workflows/secrets-leak-detector]
module.secrets_leaks_log_scanner.google_eventarc_trigger.secrets_leak_detector_workflow: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/triggers/secrets-leak-detector]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + create_time   = (known after apply)
      + description   = "modules-internal repository"
      + format        = "DOCKER"
      + id            = (known after apply)
      + labels        = {
          + "name"  = "modules-internal"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location      = "europe"
      + mode          = "STANDARD_REPOSITORY"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = "modules-internal"
      + update_time   = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.member_service_account[0] will be created
  + resource "google_artifact_registry_repository_iam_member" "member_service_account" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"
      + project    = "sap-kyma-prow"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "reader_service_accounts" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"
      + project    = "sap-kyma-prow"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "reader_service_accounts" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"
      + project    = "sap-kyma-prow"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "reader_service_accounts" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"
      + project    = "sap-kyma-prow"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifact_registry = {
      + modules-internal = {
          + artifact_registry_collection = {
              + create_time               = (known after apply)
              + description               = "modules-internal repository"
              + docker_config             = [
                  + {
                      + immutable_tags = false
                    },
                ]
              + format                    = "DOCKER"
              + id                        = (known after apply)
              + kms_key_name              = null
              + labels                    = {
                  + "name"  = "modules-internal"
                  + "owner" = "neighbors"
                  + "type"  = "production"
                }
              + location                  = "europe"
              + maven_config              = []
              + mode                      = "STANDARD_REPOSITORY"
              + name                      = (known after apply)
              + project                   = (known after apply)
              + remote_repository_config  = []
              + repository_id             = "modules-internal"
              + timeouts                  = null
              + update_time               = (known after apply)
              + virtual_repository_config = []
            }
        }
    }
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Still creating... [10s elapsed]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Creation complete after 10s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.member_service_account[0]: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Still creating... [10s elapsed]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Still creating... [10s elapsed]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Still creating... [10s elapsed]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.member_service_account[0]: Still creating... [10s elapsed]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Creation complete after 13s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Creation complete after 18s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Creation complete after 18s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.member_service_account[0]: Creation complete after 18s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.writer/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

artifact_registry = {
  "modules-internal" = {
    "artifact_registry_collection" = {
      "create_time" = "2023-08-10T08:42:35.562245Z"
      "description" = "modules-internal repository"
      "docker_config" = tolist([])
      "format" = "DOCKER"
      "id" = "projects/sap-kyma-prow/locations/europe/repositories/modules-internal"
      "kms_key_name" = ""
      "labels" = tomap({
        "name" = "modules-internal"
        "owner" = "neighbors"
        "type" = "production"
      })
      "location" = "europe"
      "maven_config" = tolist([])
      "mode" = "STANDARD_REPOSITORY"
      "name" = "modules-internal"
      "project" = "sap-kyma-prow"
      "remote_repository_config" = tolist([])
      "repository_id" = "modules-internal"
      "timeouts" = null /* object */
      "update_time" = "2023-08-10T08:42:35.562245Z"
      "virtual_repository_config" = tolist([])
    }
  }
}
terraform_executor_gcp_prow_project_iam_member = {
  "condition" = tolist([])
  "etag" = "BwYCfDnqE7E="
  "id" = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "member" = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "project" = "sap-kyma-prow"
  "role" = "roles/owner"
}
terraform_executor_gcp_service_account = {
  "account_id" = "terraform-executor"
  "description" = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
  "disabled" = false
  "display_name" = "terraform-executor"
  "email" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "id" = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "member" = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "name" = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "project" = "sap-kyma-prow"
  "timeouts" = null /* object */
  "unique_id" = "109665069699011807029"
}
terraform_executor_gcp_workload_identity = {
  "condition" = tolist([])
  "etag" = "BwYBZe0VFi0="
  "id" = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
  "members" = toset([
    "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform",
    "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
  ])
  "role" = "roles/iam.workloadIdentityUser"
  "service_account_id" = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
}
terraform_executor_gcp_workloads_project_iam_member = {
  "condition" = tolist([])
  "etag" = "BwYATedyR9s="
  "id" = "sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "member" = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  "project" = "sap-kyma-prow-workloads"
  "role" = "roles/owner"
}
trusted_workload_gatekeeper = <sensitive>
trusted_workload_terraform_executor_k8s_service_account = {
  "automount_service_account_token" = true
  "default_secret_name" = ""
  "id" = "default/terraform-executor"
  "image_pull_secret" = toset([])
  "metadata" = tolist([
    {
      "annotations" = tomap({
        "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
      })
      "generate_name" = ""
      "generation" = 0
      "labels" = tomap({})
      "name" = "terraform-executor"
      "namespace" = "default"
      "resource_version" = "12339023"
      "uid" = "48c37f5c-7367-43f3-a0d9-b82778b47a6e"
    },
  ])
  "secret" = toset([])
  "timeouts" = null /* object */
}
untrusted_workload_gatekeeper = <sensitive>
untrusted_workload_terraform_executor_k8s_service_account = {
  "automount_service_account_token" = true
  "default_secret_name" = ""
  "id" = "default/terraform-executor"
  "image_pull_secret" = toset([])
  "metadata" = tolist([
    {
      "annotations" = tomap({
        "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
      })
      "generate_name" = ""
      "generation" = 0
      "labels" = tomap({})
      "name" = "terraform-executor"
      "namespace" = "default"
      "resource_version" = "611209604"
      "uid" = "bab03c90-cf4a-439e-8d88-491bd1cc40f7"
    },
  ])
  "secret" = toset([])
  "timeouts" = null /* object */
}

```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8479,"Program":"tfcmt","SHA1":"c219430fb5e12244ef7efba5ab7487f38d905c7a","Vars":{}} -->